; domain
;;Created by Tomas de la Rosa
;;Domain for painting floor tiles with two colors

(define (domain floor-tile)
(:requirements :typing)
(:types robot tile color - object)

(:predicates 	
		(robot-at ?r - robot ?x - tile)
		(up ?x - tile ?y - tile)
		(down ?x - tile ?y - tile)
		(right ?x - tile ?y - tile)
		(left ?x - tile ?y - tile)
		
		(clear ?x - tile)
                (painted ?x - tile ?c - color)
		(robot-has ?r - robot ?c - color)
                (available-color ?c - color)
                (free-color ?r - robot))

(:functions (total-cost))

(:action change-color
  :parameters (?r - robot ?c - color ?c2 - color)
  :precondition (and (robot-has ?r ?c) (available-color ?c2))
  :effect (and (not (robot-has ?r ?c)) (robot-has ?r ?c2)
               (increase (total-cost) 5))
) 


(:action paint-up
  :parameters (?r - robot ?y - tile ?x - tile ?c - color)
  :precondition (and (robot-has ?r ?c) (robot-at ?r ?x) (up ?y ?x) (clear ?y))
  :effect (and (not (clear ?y)) (painted ?y ?c)
               (increase (total-cost) 2))
)


(:action paint-down
  :parameters (?r - robot ?y - tile ?x - tile ?c - color)
  :precondition (and (robot-has ?r ?c) (robot-at ?r ?x) (down ?y ?x) (clear ?y))
  :effect (and (not (clear ?y)) (painted ?y ?c)
(increase (total-cost) 2))
)


; Robot movements
(:action up 
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (up ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y))
               (increase (total-cost) 3))
)


(:action down 
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (down ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y))
               (increase (total-cost) 1))
)

(:action right 
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (right ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y))
	       (increase (total-cost) 1))
)

(:action left 
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (left ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y))
               (increase (total-cost) 1))
)

)

; problem
(define (problem name)
 (:domain floor-tile)
 (:objects tile_0-1 tile_0-2 tile_0-3 tile_0-4 tile_0-5 
           tile_1-1 tile_1-2 tile_1-3 tile_1-4 tile_1-5 
           tile_2-1 tile_2-2 tile_2-3 tile_2-4 tile_2-5 
           tile_3-1 tile_3-2 tile_3-3 tile_3-4 tile_3-5 
           tile_4-1 tile_4-2 tile_4-3 tile_4-4 tile_4-5 
           tile_5-1 tile_5-2 tile_5-3 tile_5-4 tile_5-5 
           tile_6-1 tile_6-2 tile_6-3 tile_6-4 tile_6-5 
           tile_7-1 tile_7-2 tile_7-3 tile_7-4 tile_7-5 - tile
           robot1 robot2 - robot
           white black - color
)
 (:init 
   (= (total-cost) 0)
   (robot-at robot1 tile_1-1)
   (robot-has robot1 white)
   (robot-at robot2 tile_4-3)
   (robot-has robot2 black)
   (available-color white)
   (available-color black)
   (clear tile_0-1)
   (clear tile_0-2)
   (clear tile_0-3)
   (clear tile_0-4)
   (clear tile_0-5)
   (clear tile_1-2)
   (clear tile_1-3)
   (clear tile_1-4)
   (clear tile_1-5)
   (clear tile_2-1)
   (clear tile_2-2)
   (clear tile_2-3)
   (clear tile_2-4)
   (clear tile_2-5)
   (clear tile_3-1)
   (clear tile_3-2)
   (clear tile_3-3)
   (clear tile_3-4)
   (clear tile_3-5)
   (clear tile_4-1)
   (clear tile_4-2)
   (clear tile_4-4)
   (clear tile_4-5)
   (clear tile_5-1)
   (clear tile_5-2)
   (clear tile_5-3)
   (clear tile_5-4)
   (clear tile_5-5)
   (clear tile_6-1)
   (clear tile_6-2)
   (clear tile_6-3)
   (clear tile_6-4)
   (clear tile_6-5)
   (clear tile_7-1)
   (clear tile_7-2)
   (clear tile_7-3)
   (clear tile_7-4)
   (clear tile_7-5)
   (up tile_1-1 tile_0-1)
   (up tile_1-2 tile_0-2)
   (up tile_1-3 tile_0-3)
   (up tile_1-4 tile_0-4)
   (up tile_1-5 tile_0-5)
   (up tile_2-1 tile_1-1)
   (up tile_2-2 tile_1-2)
   (up tile_2-3 tile_1-3)
   (up tile_2-4 tile_1-4)
   (up tile_2-5 tile_1-5)
   (up tile_3-1 tile_2-1)
   (up tile_3-2 tile_2-2)
   (up tile_3-3 tile_2-3)
   (up tile_3-4 tile_2-4)
   (up tile_3-5 tile_2-5)
   (up tile_4-1 tile_3-1)
   (up tile_4-2 tile_3-2)
   (up tile_4-3 tile_3-3)
   (up tile_4-4 tile_3-4)
   (up tile_4-5 tile_3-5)
   (up tile_5-1 tile_4-1)
   (up tile_5-2 tile_4-2)
   (up tile_5-3 tile_4-3)
   (up tile_5-4 tile_4-4)
   (up tile_5-5 tile_4-5)
   (up tile_6-1 tile_5-1)
   (up tile_6-2 tile_5-2)
   (up tile_6-3 tile_5-3)
   (up tile_6-4 tile_5-4)
   (up tile_6-5 tile_5-5)
   (up tile_7-1 tile_6-1)
   (up tile_7-2 tile_6-2)
   (up tile_7-3 tile_6-3)
   (up tile_7-4 tile_6-4)
   (up tile_7-5 tile_6-5)
   (down tile_0-1 tile_1-1)
   (down tile_0-2 tile_1-2)
   (down tile_0-3 tile_1-3)
   (down tile_0-4 tile_1-4)
   (down tile_0-5 tile_1-5)
   (down tile_1-1 tile_2-1)
   (down tile_1-2 tile_2-2)
   (down tile_1-3 tile_2-3)
   (down tile_1-4 tile_2-4)
   (down tile_1-5 tile_2-5)
   (down tile_2-1 tile_3-1)
   (down tile_2-2 tile_3-2)
   (down tile_2-3 tile_3-3)
   (down tile_2-4 tile_3-4)
   (down tile_2-5 tile_3-5)
   (down tile_3-1 tile_4-1)
   (down tile_3-2 tile_4-2)
   (down tile_3-3 tile_4-3)
   (down tile_3-4 tile_4-4)
   (down tile_3-5 tile_4-5)
   (down tile_4-1 tile_5-1)
   (down tile_4-2 tile_5-2)
   (down tile_4-3 tile_5-3)
   (down tile_4-4 tile_5-4)
   (down tile_4-5 tile_5-5)
   (down tile_5-1 tile_6-1)
   (down tile_5-2 tile_6-2)
   (down tile_5-3 tile_6-3)
   (down tile_5-4 tile_6-4)
   (down tile_5-5 tile_6-5)
   (down tile_6-1 tile_7-1)
   (down tile_6-2 tile_7-2)
   (down tile_6-3 tile_7-3)
   (down tile_6-4 tile_7-4)
   (down tile_6-5 tile_7-5)
   (right tile_0-2 tile_0-1)
   (right tile_0-3 tile_0-2)
   (right tile_0-4 tile_0-3)
   (right tile_0-5 tile_0-4)
   (right tile_1-2 tile_1-1)
   (right tile_1-3 tile_1-2)
   (right tile_1-4 tile_1-3)
   (right tile_1-5 tile_1-4)
   (right tile_2-2 tile_2-1)
   (right tile_2-3 tile_2-2)
   (right tile_2-4 tile_2-3)
   (right tile_2-5 tile_2-4)
   (right tile_3-2 tile_3-1)
   (right tile_3-3 tile_3-2)
   (right tile_3-4 tile_3-3)
   (right tile_3-5 tile_3-4)
   (right tile_4-2 tile_4-1)
   (right tile_4-3 tile_4-2)
   (right tile_4-4 tile_4-3)
   (right tile_4-5 tile_4-4)
   (right tile_5-2 tile_5-1)
   (right tile_5-3 tile_5-2)
   (right tile_5-4 tile_5-3)
   (right tile_5-5 tile_5-4)
   (right tile_6-2 tile_6-1)
   (right tile_6-3 tile_6-2)
   (right tile_6-4 tile_6-3)
   (right tile_6-5 tile_6-4)
   (right tile_7-2 tile_7-1)
   (right tile_7-3 tile_7-2)
   (right tile_7-4 tile_7-3)
   (right tile_7-5 tile_7-4)
   (left tile_0-1 tile_0-2)
   (left tile_0-2 tile_0-3)
   (left tile_0-3 tile_0-4)
   (left tile_0-4 tile_0-5)
   (left tile_1-1 tile_1-2)
   (left tile_1-2 tile_1-3)
   (left tile_1-3 tile_1-4)
   (left tile_1-4 tile_1-5)
   (left tile_2-1 tile_2-2)
   (left tile_2-2 tile_2-3)
   (left tile_2-3 tile_2-4)
   (left tile_2-4 tile_2-5)
   (left tile_3-1 tile_3-2)
   (left tile_3-2 tile_3-3)
   (left tile_3-3 tile_3-4)
   (left tile_3-4 tile_3-5)
   (left tile_4-1 tile_4-2)
   (left tile_4-2 tile_4-3)
   (left tile_4-3 tile_4-4)
   (left tile_4-4 tile_4-5)
   (left tile_5-1 tile_5-2)
   (left tile_5-2 tile_5-3)
   (left tile_5-3 tile_5-4)
   (left tile_5-4 tile_5-5)
   (left tile_6-1 tile_6-2)
   (left tile_6-2 tile_6-3)
   (left tile_6-3 tile_6-4)
   (left tile_6-4 tile_6-5)
   (left tile_7-1 tile_7-2)
   (left tile_7-2 tile_7-3)
   (left tile_7-3 tile_7-4)
   (left tile_7-4 tile_7-5)
)
 (:goal (and
    (painted tile_1-1 white)
    (painted tile_1-2 black)
    (painted tile_1-3 white)
    (painted tile_1-4 black)
    (painted tile_1-5 white)
    (painted tile_2-1 black)
    (painted tile_2-2 white)
    (painted tile_2-3 black)
    (painted tile_2-4 white)
    (painted tile_2-5 black)
    (painted tile_3-1 white)
    (painted tile_3-2 black)
    (painted tile_3-3 white)
    (painted tile_3-4 black)
    (painted tile_3-5 white)
    (painted tile_4-1 black)
    (painted tile_4-2 white)
    (painted tile_4-3 black)
    (painted tile_4-4 white)
    (painted tile_4-5 black)
    (painted tile_5-1 white)
    (painted tile_5-2 black)
    (painted tile_5-3 white)
    (painted tile_5-4 black)
    (painted tile_5-5 white)
    (painted tile_6-1 black)
    (painted tile_6-2 white)
    (painted tile_6-3 black)
    (painted tile_6-4 white)
    (painted tile_6-5 black)
    (painted tile_7-1 white)
    (painted tile_7-2 black)
    (painted tile_7-3 white)
    (painted tile_7-4 black)
    (painted tile_7-5 white)
))
 (:metric minimize (total-cost))
)

; plan
1. (up robot2 tile_4-3 tile_5-3)
   deleted: (robot-at robot2 tile_4-3) (clear tile_5-3)
   added: (robot-at robot2 tile_5-3) (clear tile_4-3)
   goals met: 0 of 35
2. (up robot2 tile_5-3 tile_6-3)
   deleted: (robot-at robot2 tile_5-3) (clear tile_6-3)
   added: (robot-at robot2 tile_6-3) (clear tile_5-3)
   goals met: 0 of 35
3. (right robot2 tile_6-3 tile_6-4)
   deleted: (robot-at robot2 tile_6-3) (clear tile_6-4)
   added: (robot-at robot2 tile_6-4) (clear tile_6-3)
   goals met: 0 of 35
4. (paint-up robot2 tile_7-4 tile_6-4 black)
   deleted: (clear tile_7-4)
   added: (painted tile_7-4 black)
   goals met: 1 of 35
5. (right robot2 tile_6-4 tile_6-5)
   deleted: (robot-at robot2 tile_6-4) (clear tile_6-5)
   added: (robot-at robot2 tile_6-5) (clear tile_6-4)
   goals met: 1 of 35
6. (change-color robot2 black white)
   deleted: (robot-has robot2 black)
   added: (robot-has robot2 white)
   goals met: 1 of 35
7. (paint-up robot2 tile_7-5 tile_6-5 white)
   deleted: (clear tile_7-5)
   added: (painted tile_7-5 white)
   goals met: 2 of 35
8. (left robot2 tile_6-5 tile_6-4)
   deleted: (robot-at robot2 tile_6-5) (clear tile_6-4)
   added: (robot-at robot2 tile_6-4) (clear tile_6-5)
   goals met: 2 of 35
9. (left robot2 tile_6-4 tile_6-3)
   deleted: (robot-at robot2 tile_6-4) (clear tile_6-3)
   added: (robot-at robot2 tile_6-3) (clear tile_6-4)
   goals met: 2 of 35
10. (paint-up robot2 tile_7-3 tile_6-3 white)
   deleted: (clear tile_7-3)
   added: (painted tile_7-3 white)
   goals met: 3 of 35
11. (left robot2 tile_6-3 tile_6-2)
   deleted: (robot-at robot2 tile_6-3) (clear tile_6-2)
   added: (robot-at robot2 tile_6-2) (clear tile_6-3)
   goals met: 3 of 35
12. (change-color robot2 white black)
   deleted: (robot-has robot2 white)
   added: (robot-has robot2 black)
   goals met: 3 of 35
13. (paint-up robot2 tile_7-2 tile_6-2 black)
   deleted: (clear tile_7-2)
   added: (painted tile_7-2 black)
   goals met: 4 of 35
14. (down robot2 tile_6-2 tile_5-2)
   deleted: (robot-at robot2 tile_6-2) (clear tile_5-2)
   added: (robot-at robot2 tile_5-2) (clear tile_6-2)
   goals met: 4 of 35
15. (change-color robot2 black white)
   deleted: (robot-has robot2 black)
   added: (robot-has robot2 white)
   goals met: 4 of 35
16. (paint-up robot2 tile_6-2 tile_5-2 white)
   deleted: (clear tile_6-2)
   added: (painted tile_6-2 white)
   goals met: 5 of 35
17. (left robot2 tile_5-2 tile_5-1)
   deleted: (robot-at robot2 tile_5-2) (clear tile_5-1)
   added: (robot-at robot2 tile_5-1) (clear tile_5-2)
   goals met: 5 of 35
18. (up robot2 tile_5-1 tile_6-1)
   deleted: (robot-at robot2 tile_5-1) (clear tile_6-1)
   added: (robot-at robot2 tile_6-1) (clear tile_5-1)
   goals met: 5 of 35
19. (paint-up robot2 tile_7-1 tile_6-1 white)
   deleted: (clear tile_7-1)
   added: (painted tile_7-1 white)
   goals met: 6 of 35
20. (down robot2 tile_6-1 tile_5-1)
   deleted: (robot-at robot2 tile_6-1) (clear tile_5-1)
   added: (robot-at robot2 tile_5-1) (clear tile_6-1)
   goals met: 6 of 35
21. (change-color robot2 white black)
   deleted: (robot-has robot2 white)
   added: (robot-has robot2 black)
   goals met: 6 of 35
22. (paint-up robot2 tile_6-1 tile_5-1 black)
   deleted: (clear tile_6-1)
   added: (painted tile_6-1 black)
   goals met: 7 of 35
23. (down robot2 tile_5-1 tile_4-1)
   deleted: (robot-at robot2 tile_5-1) (clear tile_4-1)
   added: (robot-at robot2 tile_4-1) (clear tile_5-1)
   goals met: 7 of 35
24. (change-color robot2 black white)
   deleted: (robot-has robot2 black)
   added: (robot-has robot2 white)
   goals met: 7 of 35
25. (paint-up robot2 tile_5-1 tile_4-1 white)
   deleted: (clear tile_5-1)
   added: (painted tile_5-1 white)
   goals met: 8 of 35
26. (down robot2 tile_4-1 tile_3-1)
   deleted: (robot-at robot2 tile_4-1) (clear tile_3-1)
   added: (robot-at robot2 tile_3-1) (clear tile_4-1)
   goals met: 8 of 35
27. (change-color robot2 white black)
   deleted: (robot-has robot2 white)
   added: (robot-has robot2 black)
   goals met: 8 of 35
28. (paint-up robot2 tile_4-1 tile_3-1 black)
   deleted: (clear tile_4-1)
   added: (painted tile_4-1 black)
   goals met: 9 of 35
29. (right robot2 tile_3-1 tile_3-2)
   deleted: (robot-at robot2 tile_3-1) (clear tile_3-2)
   added: (robot-at robot2 tile_3-2) (clear tile_3-1)
   goals met: 9 of 35
30. (up robot2 tile_3-2 tile_4-2)
   deleted: (robot-at robot2 tile_3-2) (clear tile_4-2)
   added: (robot-at robot2 tile_4-2) (clear tile_3-2)
   goals met: 9 of 35
31. (paint-up robot2 tile_5-2 tile_4-2 black)
   deleted: (clear tile_5-2)
   added: (painted tile_5-2 black)
   goals met: 10 of 35
32. (right robot2 tile_4-2 tile_4-3)
   deleted: (robot-at robot2 tile_4-2) (clear tile_4-3)
   added: (robot-at robot2 tile_4-3) (clear tile_4-2)
   goals met: 10 of 35
33. (up robot2 tile_4-3 tile_5-3)
   deleted: (robot-at robot2 tile_4-3) (clear tile_5-3)
   added: (robot-at robot2 tile_5-3) (clear tile_4-3)
   goals met: 10 of 35
34. (up robot1 tile_1-1 tile_2-1)
   deleted: (robot-at robot1 tile_1-1) (clear tile_2-1)
   added: (robot-at robot1 tile_2-1) (clear tile_1-1)
   goals met: 10 of 35
35. (paint-up robot1 tile_3-1 tile_2-1 white)
   deleted: (clear tile_3-1)
   added: (painted tile_3-1 white)
   goals met: 11 of 35
36. (right robot1 tile_2-1 tile_2-2)
   deleted: (robot-at robot1 tile_2-1) (clear tile_2-2)
   added: (robot-at robot1 tile_2-2) (clear tile_2-1)
   goals met: 11 of 35
37. (up robot1 tile_2-2 tile_3-2)
   deleted: (robot-at robot1 tile_2-2) (clear tile_3-2)
   added: (robot-at robot1 tile_3-2) (clear tile_2-2)
   goals met: 11 of 35
38. (paint-up robot1 tile_4-2 tile_3-2 white)
   deleted: (clear tile_4-2)
   added: (painted tile_4-2 white)
   goals met: 12 of 35
39. (down robot1 tile_3-2 tile_2-2)
   deleted: (robot-at robot1 tile_3-2) (clear tile_2-2)
   added: (robot-at robot1 tile_2-2) (clear tile_3-2)
   goals met: 12 of 35
40. (change-color robot1 white black)
   deleted: (robot-has robot1 white)
   added: (robot-has robot1 black)
   goals met: 12 of 35
41. (paint-up robot1 tile_3-2 tile_2-2 black)
   deleted: (clear tile_3-2)
   added: (painted tile_3-2 black)
   goals met: 13 of 35
42. (left robot1 tile_2-2 tile_2-1)
   deleted: (robot-at robot1 tile_2-2) (clear tile_2-1)
   added: (robot-at robot1 tile_2-1) (clear tile_2-2)
   goals met: 13 of 35
43. (down robot1 tile_2-1 tile_1-1)
   deleted: (robot-at robot1 tile_2-1) (clear tile_1-1)
   added: (robot-at robot1 tile_1-1) (clear tile_2-1)
   goals met: 13 of 35
44. (paint-up robot1 tile_2-1 tile_1-1 black)
   deleted: (clear tile_2-1)
   added: (painted tile_2-1 black)
   goals met: 14 of 35
45. (right robot1 tile_1-1 tile_1-2)
   deleted: (robot-at robot1 tile_1-1) (clear tile_1-2)
   added: (robot-at robot1 tile_1-2) (clear tile_1-1)
   goals met: 14 of 35
46. (paint-up robot2 tile_6-3 tile_5-3 black)
   deleted: (clear tile_6-3)
   added: (painted tile_6-3 black)
   goals met: 15 of 35
47. (change-color robot1 black white)
   deleted: (robot-has robot1 black)
   added: (robot-has robot1 white)
   goals met: 15 of 35
48. (paint-up robot1 tile_2-2 tile_1-2 white)
   deleted: (clear tile_2-2)
   added: (painted tile_2-2 white)
   goals met: 16 of 35
49. (down robot1 tile_1-2 tile_0-2)
   deleted: (robot-at robot1 tile_1-2) (clear tile_0-2)
   added: (robot-at robot1 tile_0-2) (clear tile_1-2)
   goals met: 16 of 35
50. (change-color robot1 white black)
   deleted: (robot-has robot1 white)
   added: (robot-has robot1 black)
   goals met: 16 of 35
51. (paint-up robot1 tile_1-2 tile_0-2 black)
   deleted: (clear tile_1-2)
   added: (painted tile_1-2 black)
   goals met: 17 of 35
52. (change-color robot2 black white)
   deleted: (robot-has robot2 black)
   added: (robot-has robot2 white)
   goals met: 17 of 35
53. (change-color robot1 black white)
   deleted: (robot-has robot1 black)
   added: (robot-has robot1 white)
   goals met: 17 of 35
54. (down robot2 tile_5-3 tile_4-3)
   deleted: (robot-at robot2 tile_5-3) (clear tile_4-3)
   added: (robot-at robot2 tile_4-3) (clear tile_5-3)
   goals met: 17 of 35
55. (left robot1 tile_0-2 tile_0-1)
   deleted: (robot-at robot1 tile_0-2) (clear tile_0-1)
   added: (robot-at robot1 tile_0-1) (clear tile_0-2)
   goals met: 17 of 35
56. (paint-up robot1 tile_1-1 tile_0-1 white)
   deleted: (clear tile_1-1)
   added: (painted tile_1-1 white)
   goals met: 18 of 35
57. (paint-up robot2 tile_5-3 tile_4-3 white)
   deleted: (clear tile_5-3)
   added: (painted tile_5-3 white)
   goals met: 19 of 35
58. (right robot1 tile_0-1 tile_0-2)
   deleted: (robot-at robot1 tile_0-1) (clear tile_0-2)
   added: (robot-at robot1 tile_0-2) (clear tile_0-1)
   goals met: 19 of 35
59. (right robot1 tile_0-2 tile_0-3)
   deleted: (robot-at robot1 tile_0-2) (clear tile_0-3)
   added: (robot-at robot1 tile_0-3) (clear tile_0-2)
   goals met: 19 of 35
60. (right robot2 tile_4-3 tile_4-4)
   deleted: (robot-at robot2 tile_4-3) (clear tile_4-4)
   added: (robot-at robot2 tile_4-4) (clear tile_4-3)
   goals met: 19 of 35
61. (up robot2 tile_4-4 tile_5-4)
   deleted: (robot-at robot2 tile_4-4) (clear tile_5-4)
   added: (robot-at robot2 tile_5-4) (clear tile_4-4)
   goals met: 19 of 35
62. (paint-up robot2 tile_6-4 tile_5-4 white)
   deleted: (clear tile_6-4)
   added: (painted tile_6-4 white)
   goals met: 20 of 35
63. (change-color robot2 white black)
   deleted: (robot-has robot2 white)
   added: (robot-has robot2 black)
   goals met: 20 of 35
64. (down robot2 tile_5-4 tile_4-4)
   deleted: (robot-at robot2 tile_5-4) (clear tile_4-4)
   added: (robot-at robot2 tile_4-4) (clear tile_5-4)
   goals met: 20 of 35
65. (paint-up robot2 tile_5-4 tile_4-4 black)
   deleted: (clear tile_5-4)
   added: (painted tile_5-4 black)
   goals met: 21 of 35
66. (right robot2 tile_4-4 tile_4-5)
   deleted: (robot-at robot2 tile_4-4) (clear tile_4-5)
   added: (robot-at robot2 tile_4-5) (clear tile_4-4)
   goals met: 21 of 35
67. (up robot2 tile_4-5 tile_5-5)
   deleted: (robot-at robot2 tile_4-5) (clear tile_5-5)
   added: (robot-at robot2 tile_5-5) (clear tile_4-5)
   goals met: 21 of 35
68. (paint-up robot2 tile_6-5 tile_5-5 black)
   deleted: (clear tile_6-5)
   added: (painted tile_6-5 black)
   goals met: 22 of 35
69. (change-color robot2 black white)
   deleted: (robot-has robot2 black)
   added: (robot-has robot2 white)
   goals met: 22 of 35
70. (down robot2 tile_5-5 tile_4-5)
   deleted: (robot-at robot2 tile_5-5) (clear tile_4-5)
   added: (robot-at robot2 tile_4-5) (clear tile_5-5)
   goals met: 22 of 35
71. (paint-up robot2 tile_5-5 tile_4-5 white)
   deleted: (clear tile_5-5)
   added: (painted tile_5-5 white)
   goals met: 23 of 35
72. (change-color robot2 white black)
   deleted: (robot-has robot2 white)
   added: (robot-has robot2 black)
   goals met: 23 of 35
73. (down robot2 tile_4-5 tile_3-5)
   deleted: (robot-at robot2 tile_4-5) (clear tile_3-5)
   added: (robot-at robot2 tile_3-5) (clear tile_4-5)
   goals met: 23 of 35
74. (paint-up robot2 tile_4-5 tile_3-5 black)
   deleted: (clear tile_4-5)
   added: (painted tile_4-5 black)
   goals met: 24 of 35
75. (change-color robot2 black white)
   deleted: (robot-has robot2 black)
   added: (robot-has robot2 white)
   goals met: 24 of 35
76. (down robot2 tile_3-5 tile_2-5)
   deleted: (robot-at robot2 tile_3-5) (clear tile_2-5)
   added: (robot-at robot2 tile_2-5) (clear tile_3-5)
   goals met: 24 of 35
77. (paint-up robot2 tile_3-5 tile_2-5 white)
   deleted: (clear tile_3-5)
   added: (painted tile_3-5 white)
   goals met: 25 of 35
78. (left robot2 tile_2-5 tile_2-4)
   deleted: (robot-at robot2 tile_2-5) (clear tile_2-4)
   added: (robot-at robot2 tile_2-4) (clear tile_2-5)
   goals met: 25 of 35
79. (up robot2 tile_2-4 tile_3-4)
   deleted: (robot-at robot2 tile_2-4) (clear tile_3-4)
   added: (robot-at robot2 tile_3-4) (clear tile_2-4)
   goals met: 25 of 35
80. (paint-up robot2 tile_4-4 tile_3-4 white)
   deleted: (clear tile_4-4)
   added: (painted tile_4-4 white)
   goals met: 26 of 35
81. (change-color robot2 white black)
   deleted: (robot-has robot2 white)
   added: (robot-has robot2 black)
   goals met: 26 of 35
82. (down robot2 tile_3-4 tile_2-4)
   deleted: (robot-at robot2 tile_3-4) (clear tile_2-4)
   added: (robot-at robot2 tile_2-4) (clear tile_3-4)
   goals met: 26 of 35
83. (paint-up robot2 tile_3-4 tile_2-4 black)
   deleted: (clear tile_3-4)
   added: (painted tile_3-4 black)
   goals met: 27 of 35
84. (left robot2 tile_2-4 tile_2-3)
   deleted: (robot-at robot2 tile_2-4) (clear tile_2-3)
   added: (robot-at robot2 tile_2-3) (clear tile_2-4)
   goals met: 27 of 35
85. (up robot2 tile_2-3 tile_3-3)
   deleted: (robot-at robot2 tile_2-3) (clear tile_3-3)
   added: (robot-at robot2 tile_3-3) (clear tile_2-3)
   goals met: 27 of 35
86. (paint-up robot2 tile_4-3 tile_3-3 black)
   deleted: (clear tile_4-3)
   added: (painted tile_4-3 black)
   goals met: 28 of 35
87. (change-color robot2 black white)
   deleted: (robot-has robot2 black)
   added: (robot-has robot2 white)
   goals met: 28 of 35
88. (down robot2 tile_3-3 tile_2-3)
   deleted: (robot-at robot2 tile_3-3) (clear tile_2-3)
   added: (robot-at robot2 tile_2-3) (clear tile_3-3)
   goals met: 28 of 35
89. (paint-up robot2 tile_3-3 tile_2-3 white)
   deleted: (clear tile_3-3)
   added: (painted tile_3-3 white)
   goals met: 29 of 35
90. (change-color robot2 white black)
   deleted: (robot-has robot2 white)
   added: (robot-has robot2 black)
   goals met: 29 of 35
91. (down robot2 tile_2-3 tile_1-3)
   deleted: (robot-at robot2 tile_2-3) (clear tile_1-3)
   added: (robot-at robot2 tile_1-3) (clear tile_2-3)
   goals met: 29 of 35
92. (paint-up robot2 tile_2-3 tile_1-3 black)
   deleted: (clear tile_2-3)
   added: (painted tile_2-3 black)
   goals met: 30 of 35
93. (change-color robot2 black white)
   deleted: (robot-has robot2 black)
   added: (robot-has robot2 white)
   goals met: 30 of 35
94. (right robot2 tile_1-3 tile_1-4)
   deleted: (robot-at robot2 tile_1-3) (clear tile_1-4)
   added: (robot-at robot2 tile_1-4) (clear tile_1-3)
   goals met: 30 of 35
95. (paint-up robot1 tile_1-3 tile_0-3 white)
   deleted: (clear tile_1-3)
   added: (painted tile_1-3 white)
   goals met: 31 of 35
96. (change-color robot1 white black)
   deleted: (robot-has robot1 white)
   added: (robot-has robot1 black)
   goals met: 31 of 35
97. (paint-up robot2 tile_2-4 tile_1-4 white)
   deleted: (clear tile_2-4)
   added: (painted tile_2-4 white)
   goals met: 32 of 35
98. (change-color robot2 white black)
   deleted: (robot-has robot2 white)
   added: (robot-has robot2 black)
   goals met: 32 of 35
99. (right robot1 tile_0-3 tile_0-4)
   deleted: (robot-at robot1 tile_0-3) (clear tile_0-4)
   added: (robot-at robot1 tile_0-4) (clear tile_0-3)
   goals met: 32 of 35
100. (right robot2 tile_1-4 tile_1-5)
   deleted: (robot-at robot2 tile_1-4) (clear tile_1-5)
   added: (robot-at robot2 tile_1-5) (clear tile_1-4)
   goals met: 32 of 35
101. (paint-up robot1 tile_1-4 tile_0-4 black)
   deleted: (clear tile_1-4)
   added: (painted tile_1-4 black)
   goals met: 33 of 35
102. (paint-up robot2 tile_2-5 tile_1-5 black)
   deleted: (clear tile_2-5)
   added: (painted tile_2-5 black)
   goals met: 34 of 35
103. (change-color robot2 black white)
   deleted: (robot-has robot2 black)
   added: (robot-has robot2 white)
   goals met: 34 of 35
104. (down robot2 tile_1-5 tile_0-5)
   deleted: (robot-at robot2 tile_1-5) (clear tile_0-5)
   added: (robot-at robot2 tile_0-5) (clear tile_1-5)
   goals met: 34 of 35
105. (paint-up robot2 tile_1-5 tile_0-5 white)
   deleted: (clear tile_1-5)
   added: (painted tile_1-5 white)
   goals met: 35 of 35
